// Написать программу, которая запросит пользователя ввести <Имя> в консоли.
// Получит введенную строку и выведет в консоль сообщение "Привет, <Имя>!"

// package seminar1;

// import java.util.Scanner;

// public class Task2_input_name_hello {
//     public static void main(String[] args) {
//         System.out.print("Введите имя: ");
//         Scanner inputScanner = new Scanner(System.in); // Scanner inputScanner = new Scanner(System.in, "ibm866") чтобы можно было русские буквы использовать
//         String name = inputScanner.nextLine();
//         System.out.printf("Привет, %s!\n", name);
//         inputScanner.close();
//     }
// }
